jet_in_flow/2_pisoFoam_turbulent_nonmixing/mesh_20/U1_1_U2_2/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | nut: turbulent kinematic viscosity
   \\    /   O peration     |
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inletMain
    {
        type    calculated;
        value   uniform 0;
    }

    outlet
    {
        type    calculated;
        value   uniform 0;
    }

    jetInlet
    {
        type    calculated;
        value   uniform 0;
    }

    top
    {
        type    nutkWallFunction;
        value   uniform 0;
    }

    floor
    {
        type    nutkWallFunction;
        value   uniform 0;
    }

    sideWalls
    {
        type    nutkWallFunction;
        value   uniform 0;
    }

    ductWalls
    {
        type    nutkWallFunction;
        value   uniform 0;
    }
}
// ************************************************************************* //
