jet_in_flow/2_pisoFoam_turbulent_nonmixing/mesh_20/U1_1_U2_2/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | omega: specific dissipation rate
   \\    /   O peration     |
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 10;

boundaryField
{
    inletMain
    {
        type    fixedValue;
        value   uniform 10;
    }

    outlet
    {
        type    zeroGradient;
    }

    jetInlet
    {
        type    fixedValue;
        value   uniform 20;   // höher als Hauptstrom
    }

    top
    {
        type    omegaWallFunction;
        value   uniform 10;
    }

    floor
    {
        type    omegaWallFunction;
        value   uniform 10;
    }

    sideWalls
    {
        type    omegaWallFunction;
        value   uniform 10;
    }

    ductWalls
    {
        type    omegaWallFunction;
        value   uniform 10;
    }
}
// ************************************************************************* //
